stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pwr_ex.h
/**
  ******************************************************************************
  * @file    stm32wb0x_hal_pwr_ex.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_HAL_PWR_EX_H
#define STM32WB0x_HAL_PWR_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x_hal_def.h"

/** @addtogroup STM32WB0x_HAL_Driver
  * @{
  */

/** @addtogroup PWREx
  * @{
  */
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup PWREx_Exported_Constants  PWR Extended Exported Constants
  * @{
  */

/** @defgroup PWREx_WakeUp_Pins  PWR Wake-up pins
  * @{
  */
#if !defined(PWR_CR6_EWU20)
#define PWR_WAKEUP_CR3_ALL        (0x00000FFFU)
#define PWR_WAKEUP_CR6_ALL        (0x000000FFU << 16)
#define PWR_WAKEUP_ALL            0x00FF0FFFU               /*!< Enable all the wakeup source                   */
#define PWR_WAKEUP_PIN_RTC        PWR_CR3_EIWL              /*!< Enable wakeup on Internal event (RTC)          */
#define PWR_WAKEUP_PIN_LPUART     PWR_CR3_EIWL2             /*!< Enable wakeup on Internal event 2 (LPUART)     */
#define PWR_WAKEUP_BLEHOST        PWR_CR3_EWBLEHCPU         /*!< Enable wakeup on BLE Host CPU event            */
#define PWR_WAKEUP_BLE            PWR_CR3_EWBLE             /*!< Enable wakeup on BLE event                     */
#define PWR_WAKEUP_PA11           PWR_CR3_EWU11             /*!< Enable wakeup on PA11 I/O event                */
#define PWR_WAKEUP_PA10           PWR_CR3_EWU10             /*!< Enable wakeup on PA10 I/O event                */
#define PWR_WAKEUP_PA9            PWR_CR3_EWU9              /*!< Enable wakeup on PA9 I/O event                 */
#define PWR_WAKEUP_PA8            PWR_CR3_EWU8              /*!< Enable wakeup on PA8 I/O event                 */
#define PWR_WAKEUP_PA3            (PWR_CR6_EWU15 << 16)     /*!< Enable wakeup on PA3 I/O event                 */
#define PWR_WAKEUP_PA2            (PWR_CR6_EWU14 << 16)     /*!< Enable wakeup on PA2 I/O event                 */
#define PWR_WAKEUP_PA1            (PWR_CR6_EWU13 << 16)     /*!< Enable wakeup on PA1 I/O event                 */
#define PWR_WAKEUP_PA0            (PWR_CR6_EWU12 << 16)     /*!< Enable wakeup on PA0 I/O event                 */
#define PWR_WAKEUP_PB7            PWR_CR3_EWU7              /*!< Enable wakeup on PB7 I/O event                 */
#define PWR_WAKEUP_PB6            PWR_CR3_EWU6              /*!< Enable wakeup on PB6 I/O event                 */
#define PWR_WAKEUP_PB5            PWR_CR3_EWU5              /*!< Enable wakeup on PB5 I/O event                 */
#define PWR_WAKEUP_PB4            PWR_CR3_EWU4              /*!< Enable wakeup on PB4 I/O event                 */
#define PWR_WAKEUP_PB3            PWR_CR3_EWU3              /*!< Enable wakeup on PB3 I/O event                 */
#define PWR_WAKEUP_PB2            PWR_CR3_EWU2              /*!< Enable wakeup on PB2 I/O event                 */
#define PWR_WAKEUP_PB1            PWR_CR3_EWU1              /*!< Enable wakeup on PB1 I/O event                 */
#define PWR_WAKEUP_PB0            PWR_CR3_EWU0              /*!< Enable wakeup on PB0 I/O event                 */
#define PWR_WAKEUP_PB15           (PWR_CR6_EWU19 << 16)     /*!< Enable wakeup on PB15 I/O event                */
#define PWR_WAKEUP_PB14           (PWR_CR6_EWU18 << 16)     /*!< Enable wakeup on PB14 I/O event                */
#define PWR_WAKEUP_PB13           (PWR_CR6_EWU17 << 16)     /*!< Enable wakeup on PB13 I/O event                */
#define PWR_WAKEUP_PB12           (PWR_CR6_EWU16 << 16)     /*!< Enable wakeup on PB12 I/O event                */
#else
#define PWR_WAKEUP_CR3_ALL        0x00000FFFU
#define PWR_WAKEUP_CR6_ALL        (0x0000FFFFU << 16)
#define PWR_WAKEUP_ALL            0xFFFF0FFFU               /*!< Enable all the wakeup source                   */
#define PWR_WAKEUP_PIN_RTC        PWR_CR3_EIWL              /*!< Enable wakeup on Internal event (RTC)          */
#define PWR_WAKEUP_BLEHOST        PWR_CR3_EWBLEHCPU         /*!< Enable wakeup on BLE Host CPU event            */
#define PWR_WAKEUP_BLE            PWR_CR3_EWBLE             /*!< Enable wakeup on BLE event                     */
#define PWR_WAKEUP_PA15           (PWR_CR6_EWU27 << 16)     /*!< Enable wakeup on PA15 I/O event                */
#define PWR_WAKEUP_PA14           (PWR_CR6_EWU26 << 16)     /*!< Enable wakeup on PA14 I/O event                */
#define PWR_WAKEUP_PA13           (PWR_CR6_EWU25 << 16)     /*!< Enable wakeup on PA13 I/O event                */
#define PWR_WAKEUP_PA12           (PWR_CR6_EWU24 << 16)     /*!< Enable wakeup on PA12 I/O event                */
#define PWR_WAKEUP_PA11           PWR_CR3_EWU11             /*!< Enable wakeup on PA11 I/O event                */
#define PWR_WAKEUP_PA10           PWR_CR3_EWU10             /*!< Enable wakeup on PA10 I/O event                */
#define PWR_WAKEUP_PA9            PWR_CR3_EWU9              /*!< Enable wakeup on PA9 I/O event                 */
#define PWR_WAKEUP_PA8            PWR_CR3_EWU8              /*!< Enable wakeup on PA8 I/O event                 */
#define PWR_WAKEUP_PA7            (PWR_CR6_EWU19 << 16)     /*!< Enable wakeup on LP-PA7 I/O event              */
#define PWR_WAKEUP_PA6            (PWR_CR6_EWU18 << 16)     /*!< Enable wakeup on LP-PA6 I/O event              */
#define PWR_WAKEUP_PA5            (PWR_CR6_EWU17 << 16)     /*!< Enable wakeup on LP-PA5 I/O event              */
#define PWR_WAKEUP_PA4            (PWR_CR6_EWU16 << 16)     /*!< Enable wakeup on LP-PA4 I/O event              */
#define PWR_WAKEUP_PA3            (PWR_CR6_EWU15 << 16)     /*!< Enable wakeup on PA3 I/O event                 */
#define PWR_WAKEUP_PA2            (PWR_CR6_EWU14 << 16)     /*!< Enable wakeup on PA2 I/O event                 */
#define PWR_WAKEUP_PA1            (PWR_CR6_EWU13 << 16)     /*!< Enable wakeup on PA1 I/O event                 */
#define PWR_WAKEUP_PA0            (PWR_CR6_EWU12 << 16)     /*!< Enable wakeup on PA0 I/O event                 */
#define PWR_WAKEUP_PB11           (PWR_CR6_EWU23 << 16)     /*!< Enable wakeup on PB11 I/O event                */
#define PWR_WAKEUP_PB10           (PWR_CR6_EWU22 << 16)     /*!< Enable wakeup on PB10 I/O event                */
#define PWR_WAKEUP_PB9            (PWR_CR6_EWU21 << 16)     /*!< Enable wakeup on PB9 I/O event                 */
#define PWR_WAKEUP_PB8            (PWR_CR6_EWU20 << 16)     /*!< Enable wakeup on PB8 I/O event                 */
#define PWR_WAKEUP_PB7            PWR_CR3_EWU7              /*!< Enable wakeup on PB7 I/O event                 */
#define PWR_WAKEUP_PB6            PWR_CR3_EWU6              /*!< Enable wakeup on PB6 I/O event                 */
#define PWR_WAKEUP_PB5            PWR_CR3_EWU5              /*!< Enable wakeup on PB5 I/O event                 */
#define PWR_WAKEUP_PB4            PWR_CR3_EWU4              /*!< Enable wakeup on PB4 I/O event                 */
#define PWR_WAKEUP_PB3            PWR_CR3_EWU3              /*!< Enable wakeup on PB3 I/O event                 */
#define PWR_WAKEUP_PB2            PWR_CR3_EWU2              /*!< Enable wakeup on PB2 I/O event                 */
#define PWR_WAKEUP_PB1            PWR_CR3_EWU1              /*!< Enable wakeup on PB1 I/O event                 */
#define PWR_WAKEUP_PB0            PWR_CR3_EWU0              /*!< Enable wakeup on PB0 I/O event                 */
#endif /* !defined PWR_CR6_EWU20 */

/**
  * @}
  */

/** @defgroup PWREx_GPIO_Bit_Number GPIO bit number I/O setting in shutdown mode
  * @{
  */
#define PWR_GPIO_BIT_0   PWR_PUCRA_PA0    /*!< GPIO port I/O pin 0  */
#define PWR_GPIO_BIT_1   PWR_PUCRA_PA1    /*!< GPIO port I/O pin 1  */
#define PWR_GPIO_BIT_2   PWR_PUCRB_PB2    /*!< GPIO port I/O pin 2  */
#define PWR_GPIO_BIT_3   PWR_PUCRB_PB3    /*!< GPIO port I/O pin 3  */
#define PWR_GPIO_BIT_4   PWR_PUCRB_PB4    /*!< GPIO port I/O pin 4  */
#define PWR_GPIO_BIT_5   PWR_PUCRB_PB5    /*!< GPIO port I/O pin 5  */
#define PWR_GPIO_BIT_6   PWR_PUCRB_PB6    /*!< GPIO port I/O pin 6  */
#define PWR_GPIO_BIT_7   PWR_PUCRB_PB7    /*!< GPIO port I/O pin 7  */
#define PWR_GPIO_BIT_8   PWR_PUCRA_PA8    /*!< GPIO port I/O pin 8  */
#define PWR_GPIO_BIT_9   PWR_PUCRA_PA9    /*!< GPIO port I/O pin 9  */
#define PWR_GPIO_BIT_10  PWR_PUCRA_PA10   /*!< GPIO port I/O pin 10 */
#define PWR_GPIO_BIT_11  PWR_PUCRA_PA11   /*!< GPIO port I/O pin 11 */
#define PWR_GPIO_BIT_12  PWR_PUCRB_PB12   /*!< GPIO port I/O pin 12 */
#define PWR_GPIO_BIT_13  PWR_PUCRB_PB13   /*!< GPIO port I/O pin 13 */
#define PWR_GPIO_BIT_14  PWR_PUCRB_PB14   /*!< GPIO port I/O pin 14 */
#define PWR_GPIO_BIT_15  PWR_PUCRB_PB15   /*!< GPIO port I/O pin 15 */
/**
  * @}
  */

/** @defgroup PWREx_Flag  PWR Status Flags
  *        Elements values convention: 0000 0000 XXXY YYYYb
  *           - Y YYYY  : Flag position in the XXX register (5 bits)
  *           - XXX  : Status register (3 bits)
  *                 - 001: SR1 register
  *                 - 010: SR2 register
  *                 - 011: SR3 register
  *                 - 100: EXTSRR register
  * @{
  */
/*--------------------------------SR1-------------------------------*/
#define PWR_FLAG_WUF0                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF0_Pos)       /*!< Wakeup event on wakeup pin PB0 */
#define PWR_FLAG_WUF1                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF1_Pos)       /*!< Wakeup event on wakeup pin PB1 */
#define PWR_FLAG_WUF2                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF2_Pos)       /*!< Wakeup event on wakeup pin PB2 */
#define PWR_FLAG_WUF3                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF3_Pos)       /*!< Wakeup event on wakeup pin PB3 */
#define PWR_FLAG_WUF4                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF4_Pos)       /*!< Wakeup event on wakeup pin PB4 */
#define PWR_FLAG_WUF5                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF5_Pos)       /*!< Wakeup event on wakeup pin PB5 */
#define PWR_FLAG_WUF6                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF6_Pos)       /*!< Wakeup event on wakeup pin PB6 */
#define PWR_FLAG_WUF7                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF7_Pos)       /*!< Wakeup event on wakeup pin PB7 */
#define PWR_FLAG_WUF8                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF8_Pos)       /*!< Wakeup event on wakeup pin PA8 */
#define PWR_FLAG_WUF9                       (PWR_FLAG_REG_SR1 | PWR_SR1_WUF9_Pos)       /*!< Wakeup event on wakeup pin PA9 */
#define PWR_FLAG_WUF10                      (PWR_FLAG_REG_SR1 | PWR_SR1_WUF10_Pos)      /*!< Wakeup event on wakeup pin PA10 */
#define PWR_FLAG_WUF11                      (PWR_FLAG_REG_SR1 | PWR_SR1_WUF11_Pos)      /*!< Wakeup event on wakeup pin PA11 */
#define PWR_FLAG_WBLEF                      (PWR_FLAG_REG_SR1 | PWR_SR1_WBLEF_Pos)      /*!< Bluetooth LE WakeUp Flag */
#define PWR_FLAG_BHWF                       (PWR_FLAG_REG_SR1 | PWR_SR1_WBLEHCPUF_Pos)  /*!< Bluetooth LE Host CPU WakeUp Flag */
#define PWR_FLAG_WUFI                       (PWR_FLAG_REG_SR1 | PWR_SR1_IWUF_Pos)       /*!< Wakeup on internal wakeup line */
#if defined(PWR_CR3_EIWL2)
#define PWR_FLAG_IWUF2                      (PWR_FLAG_REG_SR1 | PWR_SR1_IWUF2_Pos)      /*!< Wakeup on internal wakeup 2 line */
#define PWR_FLAG_SR1_ALL                    0x0000FFFFU
#else
#define PWR_FLAG_SR1_ALL                    0x0000BFFFU
#endif /* PWR_CR3_EIWL2 */

