stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pwr_ex.h
/*--------------------------------SR2-------------------------------*/
#define PWR_FLAG_SMPSBYPR                   (PWR_FLAG_REG_SR2 | PWR_SR2_SMPSBYPR_Pos)   /*!< SMPS in SMPS PRECHARGE mode */
#define PWR_FLAG_SMPSENR                    (PWR_FLAG_REG_SR2 | PWR_SR2_SMPSENR_Pos)    /*!< SMPS in RUN mode Flag */

#define PWR_FLAG_SMPSRDYF                   (PWR_FLAG_REG_SR2 | PWR_SR2_SMPSRDY_Pos)    /*!< SMPS Ready Flag */

#define PWR_FLAG_REGLPS                     (PWR_FLAG_REG_SR2 | PWR_SR2_REGLPS_Pos)     /*!< Low-power regulator start flag */
#if defined(PWR_SR2_REGMS)
#define PWR_FLAG_REGMS                      (PWR_FLAG_REG_SR2 | PWR_SR2_REGMS_Pos)      /*!< Wakeup on internal wakeup 2 line */
#endif /* PWR_SR2_REGMS */

#define PWR_FLAG_PVDO                       (PWR_FLAG_REG_SR2 | PWR_SR2_PVDO_Pos)       /*!< Power Voltage Detector output flag */

/*------------------------------SR3---------------------------*/
#define PWR_FLAG_WUF12                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF12_Pos)       /*!< Wakeup event on wakeup pin PA0 */
#define PWR_FLAG_WUF13                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF13_Pos)       /*!< Wakeup event on wakeup pin PA1 */
#define PWR_FLAG_WUF14                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF14_Pos)       /*!< Wakeup event on wakeup pin PA2 */
#define PWR_FLAG_WUF15                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF15_Pos)       /*!< Wakeup event on wakeup pin PA3 */
#define PWR_FLAG_WUF16                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF16_Pos)       /*!< Wakeup event on wakeup pin PB12 */
#define PWR_FLAG_WUF17                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF17_Pos)       /*!< Wakeup event on wakeup pin PB13 */
#define PWR_FLAG_WUF18                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF18_Pos)       /*!< Wakeup event on wakeup pin PB14 */
#define PWR_FLAG_WUF19                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF19_Pos)       /*!< Wakeup event on wakeup pin PB15 */
#if defined(PWR_CR6_EWU20)
#define PWR_FLAG_WUF20                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF20_Pos)       /*!< Wakeup event on wakeup pin 20 */
#endif /* PWR_CR6_EWU20 */
#if defined(PWR_CR6_EWU21)
#define PWR_FLAG_WUF21                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF21_Pos)       /*!< Wakeup event on wakeup pin 21 */
#endif /* PWR_CR6_EWU21 */
#if defined (PWR_CR6_EWU22)
#define PWR_FLAG_WUF22                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF22_Pos)       /*!< Wakeup event on wakeup pin 22 */
#endif /* PWR_CR6_EWU22 */
#if defined(PWR_CR6_EWU23)
#define PWR_FLAG_WUF23                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF23_Pos)       /*!< Wakeup event on wakeup pin 23 */
#endif /* PWR_CR6_EWU23 */
#if defined(PWR_CR6_EWU24)
#define PWR_FLAG_WUF24                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF24_Pos)       /*!< Wakeup event on wakeup pin 24 */
#endif /* PWR_CR6_EWU24 */
#if defined (PWR_CR6_EWU25)
#define PWR_FLAG_WUF25                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF25_Pos)       /*!< Wakeup event on wakeup pin 25 */
#endif /* PWR_CR6_EWU25 */
#if defined(PWR_CR6_EWU26)
#define PWR_FLAG_WUF26                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF26_Pos)       /*!< Wakeup event on wakeup pin 26 */
#endif /* PWR_CR6_EWU26 */
#if defined (PWR_CR6_EWU27)
#define PWR_FLAG_WUF27                      (PWR_FLAG_REG_SR3 | PWR_SR3_WUF27_Pos)       /*!< Wakeup event on wakeup pin 27 */
#endif /* PWR_CR6_EWU27 */
#if defined(PWR_CR6_EWU20)
#define PWR_FLAG_SR3_ALL                    0x0000FFFFU
#else
#define PWR_FLAG_SR3_ALL                    0x000000FFU
#endif /* PWR_CR6_EWU20 */
#define PWR_WU_FLAG_ALL                     (PWR_FLAG_SR1_ALL | PWR_FLAG_SR3_ALL)
/*------------------------------EXTSRR---------------------------*/
#define PWR_FLAG_DEEPSTOPF                  (PWR_FLAG_REG_EXTSRR | PWR_EXTSRR_DEEPSTOPF_Pos)    /*!< System DEEPTSTOP Flag */
#define PWR_FLAG_RFPHASEF                   (PWR_FLAG_REG_EXTSRR | PWR_EXTSRR_RFPHASEF_Pos)     /*!< RFPHASE Flag */
/**
  * @}
  */

/** @defgroup PWREx_PIN_Polarity PWREx Pin Polarity configuration
  * @{
  */
#define PWR_WUP_RISIEDG          0x00000000U
#define PWR_WUP_FALLEDG          0x00000001U
/**
  * @}
  */

/** @defgroup PWR_RAMRET RAM Retention enable
  * @{
  */
#define PWR_RAMRET_1    PWR_CR2_RAMRET1
#if defined(PWR_CR2_RAMRET2)
#define PWR_RAMRET_2    PWR_CR2_RAMRET2
#endif /* PWR_CR2_RAMRET2 */
#if defined(PWR_CR2_RAMRET3)
#define PWR_RAMRET_3    PWR_CR2_RAMRET3
#endif /* PWR_CR2_RAMRET2 */

/**
  * @}
  */

/** @defgroup PWREx_GPIO GPIO port
  * @{
  */
#define PWR_GPIO_A         0x00000000U      /*!< GPIO port A */
#define PWR_GPIO_B         0x00000001U      /*!< GPIO port B */
/**
  * @}
  */

/** @defgroup PWREx_PIN_Pull PWREx Pin Pull configuration
  * @{
  */
#define PWR_PIN_NO_PULL                (0x0U)
#define PWR_PIN_PULL_UP                (0x1U)
#define PWR_PIN_PULL_DOWN              (0x2U)
/**
  * @}
  */

/** @defgroup PWREx_GPIO_PullUp_Port PWR Extended GPIO Pull-Up Port
  * @{
  */
#define PWR_GPIO_PULLUP_PORT_A         (0x00U)                                 /*!< GPIO port A */
#define PWR_GPIO_PULLUP_PORT_B         (0x01U)                                 /*!< GPIO port B */
/**
  * @}
  */

/** @defgroup PWREx_GPIO_PullDown_Port PWR Extended GPIO Pull-Down Port
  * @{
  */
#define PWR_GPIO_PULLDOWN_PORT_A       (0x00U)                                 /*!< GPIO port A */
#define PWR_GPIO_PULLDOWN_PORT_B       (0x01U)                                 /*!< GPIO port B */

/**
  * @}
  */

/** @defgroup PWREx_SMPS_OPERATING_MODES SMPS step down converter operating modes
  * @{
  */
#define PWR_SMPS_ON         0x000000000U                  /*!< SMPS step down ON */
#define PWR_SMPS_OFF        PWR_CR5_NOSMPS                /*!< SMPS step down OFF */
#define PWR_SMPS_BYPASS     PWR_SMPS_PRECHARGE         /*!< SMPS is disabled and bypassed in precharge mode */

/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_PRECHARGE_MODE SMPS PRECHARGE Mode
  * @{
  */
#define PWR_NO_SMPS_PRECHARGE    (0x000000000U)           /*!< SMPS not in pecharge mode */
#define PWR_SMPS_PRECHARGE       PWR_CR5_SMPSFBYP         /*!< SMPS is disabled and bypassed in precharge mode */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_BOM SMPS BOM
  * @{
  */
#define PWR_SMPS_BOM1       (0x000000000U)                /*!< SMPS BOM1 1.5 uH */
#define PWR_SMPS_BOM2       PWR_CR5_SMPSBOMSEL_0          /*!< SMPS BOM2 2.2 uH */
#define PWR_SMPS_BOM3       PWR_CR5_SMPSBOMSEL_1          /*!< SMPS BOM3 10 uH  */
/**
  * @}
  */

/** @defgroup PWREx_SMPS_OUTPUT_VOLTAGE_LEVEL SMPS step down converter output voltage scaling voltage level
  * @{
  */
/* Note: SMPS voltage is trimmed during device production to control
         the actual voltage level variation from device to device. */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V20    (0x000000000U)                                             /*!< SMPS step down converter supply output voltage 1.20V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V25    (PWR_CR5_SMPSLVL_0)                                        /*!< SMPS step down converter supply output voltage 1.25V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V30    (PWR_CR5_SMPSLVL_1)                                        /*!< SMPS step down converter supply output voltage 1.30V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V35    (PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)                      /*!< SMPS step down converter supply output voltage 1.35V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V40    (PWR_CR5_SMPSLVL_2)                                        /*!< SMPS step down converter supply output voltage 1.40V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V45    (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)                      /*!< SMPS step down converter supply output voltage 1.45V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V50    (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)                      /*!< SMPS step down converter supply output voltage 1.50V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V55    (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)    /*!< SMPS step down converter supply output voltage 1.55V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V60    (PWR_CR5_SMPSLVL_3)                                        /*!< SMPS step down converter supply output voltage 1.60V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V65    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_0)                      /*!< SMPS step down converter supply output voltage 1.65V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V70    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1)                      /*!< SMPS step down converter supply output voltage 1.70V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V75    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)    /*!< SMPS step down converter supply output voltage 1.75V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V80    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2)                      /*!< SMPS step down converter supply output voltage 1.80V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V85    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)    /*!< SMPS step down converter supply output voltage 1.85V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V90    (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)    /*!< SMPS step down converter supply output voltage 1.90V */
#define PWR_SMPS_OUTPUT_VOLTAGE_1V95    (PWR_CR5_SMPSLVL)                                          /*!< SMPS step down converter supply output voltage 1.95V */
/**
  * @}
  */

/** @defgroup PWREx_FLAG_REG PWR status register
  * @{
  */
#define PWR_FLAG_REG_SR1         (0x20UL)                                                                         /*!< Bitfield to indicate PWR flag located in register PWR_SR1 */
#define PWR_FLAG_REG_SR2         (0x40UL)                                                                         /*!< Bitfield to indicate PWR flag located in register PWR_SR2 */
#define PWR_FLAG_REG_SR3         (0x60UL)                                                                         /*!< Bitfield to indicate PWR flag located in register PWR_SR3 */
#define PWR_FLAG_REG_EXTSRR      (0x80UL)                                                                         /*!< Bitfield to indicate PWR flag located in register PWR_EXTSRR */
#define PWR_FLAG_REG_MASK        (PWR_FLAG_REG_SR1 | PWR_FLAG_REG_SR2 | PWR_FLAG_REG_SR3 | PWR_FLAG_REG_EXTSRR)   /*!< Bitfield mask to indicate PWR flag location in PWR register */

/**
  * @}
  */
/**
  * @}
  */
/* Private define ------------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/* Private macros --------------------------------------------------------*/
/** @defgroup  PWREx_Private_Macros   PWR Extended Private Macros
  * @{
  */

