stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pwr_ex.h
#if defined(PWR_CR6_EWU20)
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WAKEUP_PA15)    ||\
                                ((PIN) == PWR_WAKEUP_PA14)    ||\
                                ((PIN) == PWR_WAKEUP_PA13)    ||\
                                ((PIN) == PWR_WAKEUP_PA12)    ||\
                                ((PIN) == PWR_WAKEUP_PA11)    ||\
                                ((PIN) == PWR_WAKEUP_PA10)    ||\
                                ((PIN) == PWR_WAKEUP_PA9)     ||\
                                ((PIN) == PWR_WAKEUP_PA8)     ||\
                                ((PIN) == PWR_WAKEUP_PA7)     ||\
                                ((PIN) == PWR_WAKEUP_PA6)     ||\
                                ((PIN) == PWR_WAKEUP_PA5)     ||\
                                ((PIN) == PWR_WAKEUP_PA4)     ||\
                                ((PIN) == PWR_WAKEUP_PA3)     ||\
                                ((PIN) == PWR_WAKEUP_PA2)     ||\
                                ((PIN) == PWR_WAKEUP_PA1)     ||\
                                ((PIN) == PWR_WAKEUP_PA0)     ||\
                                ((PIN) == PWR_WAKEUP_PB11)    ||\
                                ((PIN) == PWR_WAKEUP_PB10)    ||\
                                ((PIN) == PWR_WAKEUP_PB9)     ||\
                                ((PIN) == PWR_WAKEUP_PB8)     ||\
                                ((PIN) == PWR_WAKEUP_PB7)     ||\
                                ((PIN) == PWR_WAKEUP_PB6)     ||\
                                ((PIN) == PWR_WAKEUP_PB5)     ||\
                                ((PIN) == PWR_WAKEUP_PB4)     ||\
                                ((PIN) == PWR_WAKEUP_PB3)     ||\
                                ((PIN) == PWR_WAKEUP_PB2)     ||\
                                ((PIN) == PWR_WAKEUP_PB1)     ||\
                                ((PIN) == PWR_WAKEUP_PB0)     ||\
                                ((PIN) == PWR_WAKEUP_CR3_ALL) ||\
                                ((PIN) == PWR_WAKEUP_CR6_ALL) ||\
                                ((PIN) == PWR_WAKEUP_ALL))
#else
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WAKEUP_PA11)    ||\
                                ((PIN) == PWR_WAKEUP_PA10)    ||\
                                ((PIN) == PWR_WAKEUP_PA9)     ||\
                                ((PIN) == PWR_WAKEUP_PA8)     ||\
                                ((PIN) == PWR_WAKEUP_PA3)     ||\
                                ((PIN) == PWR_WAKEUP_PA2)     ||\
                                ((PIN) == PWR_WAKEUP_PA1)     ||\
                                ((PIN) == PWR_WAKEUP_PA0)     ||\
                                ((PIN) == PWR_WAKEUP_PB15)    ||\
                                ((PIN) == PWR_WAKEUP_PB14)    ||\
                                ((PIN) == PWR_WAKEUP_PB13)    ||\
                                ((PIN) == PWR_WAKEUP_PB12)    ||\
                                ((PIN) == PWR_WAKEUP_PB7)     ||\
                                ((PIN) == PWR_WAKEUP_PB6)     ||\
                                ((PIN) == PWR_WAKEUP_PB5)     ||\
                                ((PIN) == PWR_WAKEUP_PB4)     ||\
                                ((PIN) == PWR_WAKEUP_PB3)     ||\
                                ((PIN) == PWR_WAKEUP_PB2)     ||\
                                ((PIN) == PWR_WAKEUP_PB1)     ||\
                                ((PIN) == PWR_WAKEUP_PB0)     ||\
                                ((PIN) == PWR_WAKEUP_CR3_ALL) ||\
                                ((PIN) == PWR_WAKEUP_CR6_ALL) ||\
                                ((PIN) == PWR_WAKEUP_ALL))

#endif /* PWR_CR6_EWU20 */

#define IS_PWR_WAKEUP_PIN_POLARITY(POLARITY)  (((POLARITY) == PWR_WUP_RISIEDG) ||\
                                               ((POLARITY) == PWR_WUP_FALLEDG))

/* Check wake up pin pull configuration parameter */
#define IS_PWR_WAKEUP_PIN_PULL(PULL) (((PULL) == PWR_PIN_NO_PULL)    ||\
                                      ((PULL) == PWR_PIN_PULL_UP)    ||\
                                      ((PULL) == PWR_PIN_PULL_DOWN))

#define IS_PWR_GPIO_BIT_NUMBER(BIT_NUMBER) (((BIT_NUMBER) & GPIO_PIN_MASK) != (uint32_t)0x00)

#define IS_PWR_GPIO(GPIO) (((GPIO) == PWR_GPIO_A) ||\
                           ((GPIO) == PWR_GPIO_B))

#define IS_PWR_SMPS_MODE(SMPS_MODE) (((SMPS_MODE) == PWR_SMPS_ON       )    ||\
                                     ((SMPS_MODE) == PWR_SMPS_OFF      )    ||\
                                     ((SMPS_MODE) == PWR_SMPS_PRECHARGE))

#define IS_PWR_SMPS_OUTPUT_VOLTAGE(SMPS_OUTPUT_VOLTAGE) (((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V20) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V25) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V30) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V35) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V40) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V45) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V50) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V55) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V60) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V65) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V70) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V75) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V80) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V85) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V90) ||\
                                                         ((SMPS_OUTPUT_VOLTAGE) == PWR_SMPS_OUTPUT_VOLTAGE_1V95))

