stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pwr_ex.h
#define IS_PWR_SMPS_BOM(BOM) (((BOM) == PWR_SMPS_BOM1)      ||\
                              ((BOM) == PWR_SMPS_BOM2)      ||\
                              ((BOM) == PWR_SMPS_BOM3))

/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions
  * @{
  */
/* Peripheral Control functions  **********************************************/
void              HAL_PWREx_EnableInternalWakeUpLine(void);
void              HAL_PWREx_DisableInternalWakeUpLine(void);
void              HAL_PWREx_EnableInternalWakeUpLineLpuart(void);
void              HAL_PWREx_DisableInternalWakeUpLineLpuart(void);


void              HAL_PWREx_EnableBleHostCpuWakeUp(void);
void              HAL_PWREx_DisableBleHostCpuWakeUp(void);
void              HAL_PWREx_EnableBleWakeUp(void);
void              HAL_PWREx_DisableBleWakeUp(void);

HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullUp(uint32_t GPIO, uint32_t GPIONumber);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullUp(uint32_t GPIO, uint32_t GPIONumber);
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullDown(uint32_t GPIO, uint32_t GPIONumber);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullDown(uint32_t GPIO, uint32_t GPIONumber);
void              HAL_PWREx_EnablePullUpPullDownConfig(void);
void              HAL_PWREx_DisablePullUpPullDownConfig(void);

void              HAL_PWREx_EnableSRAMRetention(uint32_t banks);
void              HAL_PWREx_DisableSRAMRetention(uint32_t banks);

void              HAL_PWREx_EnableGPIORetention(void);
void              HAL_PWREx_DisableGPIORetention(void);

void              HAL_PWREx_EnableDBGRetention(void);
void              HAL_PWREx_DisableDBGRetention(void);

HAL_StatusTypeDef HAL_PWREx_ConfigSMPS(uint32_t OutputVoltage, uint32_t BOM);
void              HAL_PWREx_SMPS_SetMode(uint32_t OperatingMode);
uint32_t          HAL_PWREx_SMPS_GetMode(void);

/* Low Power modes configuration functions ************************************/
void              HAL_PWREx_EnterSHUTDOWNMode(void);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif


#endif /* STM32WB0x_HAL_PWR_EX_H */
